app/views/admin/new_work.html.erb

SELECT "franchises".* FROM "franchises"
---
      <%= f.label :franchise_id, "Франшиза" %>
      <%= f.collection_select :franchise_id, Franchise.all, :id, :name, { selected: params[:franchise_id] } %>

SELECT "media_types".* FROM "media_types"
---
        <%= f.label :media_type_id, "Тип медиа" %>
        <%= f.collection_select :media_type_id, MediaType.all, :id, :name %>