app/views/admin/new_glossary.html.erb

SELECT "franchises".* FROM "franchises"
---
      <%= f.label :franchise_id, "Франшиза" %>
      <%= f.collection_select :franchise_id, Franchise.all, :id, :name, { selected: params[:franchise_id] } %>