app/views/admin/new_character.html.erb

SELECT "franchises".* FROM "franchises"
---
      <%= f.label :franchise_id, "Вселенная (Франшиза)" %>
      <%= f.collection_select :franchise_id, Franchise.all, :id, :name, { selected: params[:franchise_id] } %>

SELECT "character_roles".* FROM "character_roles"
---
      <%= f.label :character_role_id, "Роль" %>
      <%= f.collection_select :character_role_id, CharacterRole.all, :id, :name %>