app/views/works/show.html.erb

<%# ИСПРАВЛЕНО: Теперь мы берем героев ТОЛЬКО из той же франшизы, что и сам тайтл %>
<% franchise_characters = defined?(Character) ? Character.where(franchise_id: @work.franchise_id).order(:name) : [] %>
---
SELECT "characters".* FROM "characters" WHERE "characters"."franchise_id" = 4 ORDER BY "characters"."name" ASC