app/views/users/show.html.erb

SELECT 1 AS one FROM "characters" LIMIT 1
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = 2
---
  <div class="favorites-scroll">
    <% if current_user.favorite_characters.any? %>