app/views/users/show.html.erb

          <span>✅ Просмотрено:</span>
          <span style="color: #2ecc71; font-weight: bold;"><%= current_user.user_progresses.where(status: 'completed').count %></span>
---
SELECT COUNT(*) FROM "user_progresses" WHERE "user_progresses"."user_id" = 1 AND "user_progresses"."status" = 'completed'

          <span>📺 Смотрю сейчас:</span>
          <span style="color: #3498db; font-weight: bold;"><%= current_user.user_progresses.where(status: 'watching').count %></span>
---
SELECT COUNT(*) FROM "user_progresses" WHERE "user_progresses"."user_id" = 1 AND "user_progresses"."status" = 'watching'

          <span>⏳ В планах:</span>
          <span style="color: #f1c40f; font-weight: bold;"><%= current_user.user_progresses.where(status: 'planned').count %></span>
---
SELECT COUNT(*) FROM "user_progresses" WHERE "user_progresses"."user_id" = 1 AND "user_progresses"."status" = 'planned'

          <span style="color: #888;">Всего отметок:</span>
          <strong><%= current_user.user_progresses.count %></strong>
---
SELECT COUNT(*) FROM "user_progresses" WHERE "user_progresses"."user_id" = 1

      <div style="background: #1a1a24; padding: 20px; border-radius: 12px; margin-top: 15px;">
        <% if current_user.favorite_characters.any? %>
---
SELECT 1 AS one FROM "characters" LIMIT 1
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = 2

      <h3 style="border-bottom: 2px solid #3498db; padding-bottom: 10px;">Недавние отметки</h3>
      <% if current_user.user_progresses.any? %>
        <% current_user.user_progresses.order(updated_at: :desc).limit(5).each do |p| %>
---
SELECT 1 AS one FROM "user_progresses" WHERE "user_progresses"."user_id" = 1 LIMIT 1
SELECT "user_progresses".* FROM "user_progresses" WHERE "user_progresses"."user_id" = 1 ORDER BY "user_progresses"."updated_at" DESC LIMIT 5