app/views/home/characters.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."character_id" = 1 LIMIT 1
---
          <% if logged_in? %>
            <% fav = current_user.favorites.find_by(character: char) %>