app/views/home/characters.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."franchise_id" = 3 ORDER BY "characters"."name" ASC
---
<script>
  document.addEventListener("turbo:load", function() {
    const slides = document.querySelectorAll('.js-char-slide');
    const bg = document.getElementById('roster-bg');

    window.createCharacter = function(franchiseId) {
      const name = document.getElementById('new-char-name').value;
      const csrfToken = document.querySelector('meta[name="csrf-token"]').content;

      fetch(`/franchise/${franchiseId}/characters`, {
        method: 'POST',
        headers: { 'Content-Type': 'application/json', 'X-CSRF-Token': csrfToken },
        body: JSON.stringify({ name: name })
      }).then(async r => {
        if(r.ok) window.location.reload();
        else { const data = await r.json(); alert("Ошибка: " + data.error); }
      });
    }

    if (slides.length === 0) return;

    let currentIndex = 0; let isAnimating = false;