app/views/home/glossary.html.erb

<% is_admin = defined?(logged_in?) && logged_in? && current_user.try(:admin?) %>
<% items = defined?(Glossary) ? Glossary.where(franchise_id: @franchise.id).order(:id) : [] %>
---
SELECT "glossaries".* FROM "glossaries" WHERE "glossaries"."franchise_id" = 3 ORDER BY "glossaries"."id" ASC