app/views/home/guide.html.erb

SELECT "works".* FROM "works" WHERE "works"."id" IN (1, 2)
SELECT "user_progresses".* FROM "user_progresses" WHERE "user_progresses"."user_id" = 1 AND "user_progresses"."work_id" = 1 LIMIT 1
---
          <div style="min-width: 150px;">
            <% progress = current_user.user_progresses.find_by(work: step.work) %>