app/views/characters/show.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 2 AND "favorites"."character_id" = 4 LIMIT 1
---
      <% if defined?(logged_in?) && logged_in? %>
        <% favorite = current_user.favorites.find_by(character_id: @character.id) %>