app/controllers/admin_controller.rb

  def index
    @franchises = Franchise.all
---
SELECT "franchises".* FROM "franchises"

  def new_character
    @character = Character.new
    @franchise = Franchise.find(params[:franchise_id]) if params[:franchise_id]
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 1 LIMIT 1

  def create_character
    @character = Character.new(character_params)
    if @character.save
---
INSERT INTO "characters" ("backstory", "biography", "character_role_id", "created_at", "franchise_id", "history", "name", "photo_url", "plot_role", "status", "updated_at") VALUES (NULL, '', 3, '2026-03-02 09:36:00.747130', 1, NULL, 'андрей жилин', NULL, NULL, NULL, '2026-03-02 09:36:00.747130') RETURNING "id"

  def edit_character
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 4 LIMIT 1

  def update_character
    @character = Character.find(params[:id])
    if @character.update(character_params)
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 1 LIMIT 1
UPDATE "characters" SET "updated_at" = '2026-03-04 07:45:46.646686' WHERE "characters"."id" = 1

  def destroy_character
    char = Character.find(params[:id])
    franchise = char.franchise
    char.destroy
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 6 LIMIT 1
DELETE FROM "characters" WHERE "characters"."id" = 6

  def new_glossary
    # Вот эта строка решает ошибку ArgumentError (nil)
    @term = LoreGlossary.new
    @franchise = Franchise.find(params[:franchise_id]) if params[:franchise_id]
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 1 LIMIT 1

  def new_episode
    @episode = Episode.new
    @work = Work.find(params[:work_id]) if params[:work_id]
---
SELECT "works".* FROM "works" WHERE "works"."id" = 1 LIMIT 1

  def new_work
    @work = Work.new
    @franchise = Franchise.find(params[:franchise_id]) if params[:franchise_id]
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 1 LIMIT 1