app/controllers/api_controller.rb

  def franchises
    # Берем все франшизы из базы и превращаем их в чистый JSON
    @franchises = Franchise.all
---
SELECT "franchises".* FROM "franchises"