app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = 6 LIMIT 1
SELECT "episodes".* FROM "episodes" INNER JOIN "characters_episodes" ON "episodes"."id" = "characters_episodes"."episode_id" WHERE "characters_episodes"."character_id" = 6
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 5 LIMIT 1
SELECT "episodes".* FROM "episodes" INNER JOIN "characters_episodes" ON "episodes"."id" = "characters_episodes"."episode_id" WHERE "characters_episodes"."character_id" = 5
---
  def show
    @character = Character.find(params[:id])

    if @character.respond_to?(:episodes)
      @episodes = @character.episodes.includes(:work)
      @works = @episodes.map(&:work).compact.uniq

SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 3 LIMIT 1
INSERT INTO "characters" ("backstory", "biography", "character_role_id", "created_at", "franchise_id", "history", "name", "photo_url", "plot_role", "status", "updated_at", "description") VALUES (NULL, NULL, 3, '2026-04-10 10:14:35.104163', 3, NULL, 'Мисато Кацураги', NULL, NULL, NULL, '2026-04-10 10:14:35.104163', NULL) RETURNING "id"
SELECT "character_roles".* FROM "character_roles" ORDER BY "character_roles"."id" ASC LIMIT 1
---
  def create
    if defined?(current_user) && current_user.try(:admin?)
      franchise = Franchise.find(params[:id])

      role = CharacterRole.first || CharacterRole.create!(name: "Неизвестно")
      char = franchise.characters.new(name: params[:name], character_role: role)

      if char.save

SELECT "characters".* FROM "characters" WHERE "characters"."id" = 5 LIMIT 1
UPDATE "characters" SET "updated_at" = '2026-04-10 10:13:06.118202', "description" = '' WHERE "characters"."id" = 5
---
  def update
    @character = Character.find(params[:id])

    if defined?(current_user) && current_user.try(:admin?)
      if @character.update(params.require(:character).permit(:name, :description, :portrait))