app/controllers/episodes_controller.rb

SELECT "works".* FROM "works" WHERE "works"."id" = 6 LIMIT 1
SELECT COUNT(*) FROM "episodes" WHERE "episodes"."work_id" = 6
INSERT INTO "episodes" ("created_at", "description", "episode_number", "title", "updated_at", "work_id", "duration") VALUES ('2026-04-10 09:24:59.922181', NULL, 1, 'Эпизод 1', '2026-04-10 09:24:59.922181', 6, '24:00') RETURNING "id"
---
  def create
    work = Work.find(params[:work_id])
    episode = work.episodes.new(episode_params)

    # Подстраховка: если в базе осталось обязательное поле episode_number, заполняем его автоматом
    episode.episode_number = work.episodes.count + 1 if episode.respond_to?(:episode_number=)

    if episode.save

SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = 7 LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 6 LIMIT 1
SELECT 1 AS one FROM "characters" INNER JOIN "characters_episodes" ON "characters"."id" = "characters_episodes"."character_id" WHERE "characters_episodes"."episode_id" = 7 AND "characters"."id" = 6 LIMIT 1
---
  def add_character
    episode = Episode.find(params[:id])
    character = Character.find(params[:character_id])
    episode.characters << character unless episode.characters.include?(character)

SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = 7 LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 6 LIMIT 1
---
  def remove_character
    episode = Episode.find(params[:id])
    character = Character.find(params[:character_id])