app/controllers/favorites_controller.rb

  def create
    if !defined?(current_user) || current_user.nil?
      return render json: { error: "Войдите в аккаунт" }, status: :unauthorized
    end

    fav = current_user.favorites.new
    fav.work_id = params[:work_id] if params[:work_id].present?
    fav.character_id = params[:character_id] if params[:character_id].present?

    if fav.save
      head :ok
    else
      render json: { error: fav.errors.full_messages.join(', ') }, status: :unprocessable_entity
---
SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."character_id" = 1 LIMIT 1
INSERT INTO "favorites" ("character_id", "created_at", "updated_at", "user_id", "work_id") VALUES (5, '2026-04-10 11:34:00.081172', '2026-04-10 11:34:00.081172', 2, NULL) RETURNING "id"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."id" = 1 LIMIT 1

  def destroy
    fav = current_user.favorites.find(params[:id])
    fav.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."id" = 1 LIMIT 1
DELETE FROM "favorites" WHERE "favorites"."id" = 1