app/controllers/glossaries_controller.rb

  def create
    if defined?(current_user) && current_user.try(:admin?)
      franchise = Franchise.find(params[:id])

      # Создаем только с названием, остальное - потом
      item = franchise.glossaries.new(title: params[:title])

      if item.save
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 3 LIMIT 1
INSERT INTO "glossaries" ("title", "description", "image_url", "franchise_id", "created_at", "updated_at") VALUES ('Копьё Касия', '', NULL, 3, '2026-04-10 11:15:18.533405', '2026-04-10 11:15:18.533405') RETURNING "id"

  def update
    if defined?(current_user) && current_user.try(:admin?)
      item = Glossary.find(params[:id])

      # Разрешаем сохранять название, описание и файл картинки
      if item.update(params.require(:glossary).permit(:title, :description, :image))
---
SELECT "glossaries".* FROM "glossaries" WHERE "glossaries"."id" = 2 LIMIT 1
UPDATE "glossaries" SET "description" = '', "updated_at" = '2026-04-10 11:28:47.614462' WHERE "glossaries"."id" = 2

  def destroy
    if defined?(current_user) && current_user.try(:admin?)
      item = Glossary.find(params[:id])
      item.destroy
---
SELECT "glossaries".* FROM "glossaries" WHERE "glossaries"."id" = 1 LIMIT 1
DELETE FROM "glossaries" WHERE "glossaries"."id" = 1