app/controllers/home_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."franchise_id" = 3 ORDER BY "characters"."name" ASC
---
def characters
    @franchise = Franchise.find(params[:id])
    @characters = Character.where(franchise_id: @franchise.id).order(:name)