app/controllers/home_controller.rb

  def index
    @franchises = Franchise.all
---
SELECT "franchises".* FROM "franchises"

  def guide
    @franchise = Franchise.find(params[:id])
    guide = @franchise.watch_guides.first
    @steps = guide ? guide.guide_steps.includes(work: :media_type).order(:step_number) : []
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 1 LIMIT 1
SELECT "watch_guides".* FROM "watch_guides" WHERE "watch_guides"."franchise_id" = 1 ORDER BY "watch_guides"."id" ASC LIMIT 1
SELECT "guide_steps".* FROM "guide_steps" WHERE "guide_steps"."watch_guide_id" = 1 ORDER BY "guide_steps"."step_number" ASC
SELECT "media_types".* FROM "media_types" WHERE "media_types"."id" IN (1, 2)

  def characters
    @franchise = Franchise.find(params[:id])
    @characters = @franchise.characters.includes(:character_role)
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 5 LIMIT 1
SELECT "character_roles".* FROM "character_roles" WHERE "character_roles"."id" IN (1, 3)
SELECT "characters".* FROM "characters" WHERE "characters"."franchise_id" = 2
SELECT "user_roles".* FROM "user_roles" WHERE "user_roles"."id" = 1 LIMIT 1

  def glossary
    @franchise = Franchise.find(params[:id])
    @terms = @franchise.lore_glossaries.order(:term)
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 5 LIMIT 1
SELECT "lore_glossaries".* FROM "lore_glossaries" WHERE "lore_glossaries"."franchise_id" = 3 ORDER BY "lore_glossaries"."term" ASC

  def character_show
    @character = Character.find(params[:id])
    @franchise = @character.franchise

    # Подгружаем и общие появления в тайтлах, и конкретные эпизоды
    @appearances = @character.appearances.includes(:work).order('works.release_year ASC')
    @episodes = @character.episodes.includes(:work).order('works.release_year ASC, episodes.episode_number ASC')
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 1 LIMIT 1
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 1 LIMIT 1
SELECT "works".* FROM "works" WHERE "works"."id" = 1 LIMIT 1

  def update_character
    @character = Character.find(params[:id])

    if @character.update(character_params)
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 1 LIMIT 1
UPDATE "characters" SET "updated_at" = '2026-03-26 13:21:59.773905' WHERE "characters"."id" = 1

  def work_show
    @work = Work.find(params[:id])
    @franchise = @work.franchise
    # Подгружаем эпизоды ВМЕСТЕ с персонажами и их ролями для оптимизации БД
    @episodes = @work.episodes.includes(characters: :character_role).order(:episode_number)
---
SELECT "works".* FROM "works" WHERE "works"."id" = 1 LIMIT 1
SELECT "character_roles".* FROM "character_roles" WHERE "character_roles"."id" IN (1, 2)
SELECT "episodes".* FROM "episodes" WHERE "episodes"."work_id" = 1 ORDER BY "episodes"."episode_number" ASC

  def search
    @query = params[:query]
    if @query.present?
      @franchises = Franchise.where("name LIKE ?", "%#{@query}%")
      @characters = Character.where("name LIKE ? OR biography LIKE ?", "%#{@query}%", "%#{@query}%")
---
SELECT "franchises".* FROM "franchises" WHERE (name LIKE '%evangelion%')
SELECT "characters".* FROM "characters" WHERE (name LIKE '%Синдзи Икари%' OR biography LIKE '%Синдзи Икари%')