app/controllers/maps_controller.rb

  def show
    @franchise = Franchise.find(params[:id])
    @works = Work.where(franchise: @franchise).where.not(pos_x: nil)
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 4 LIMIT 1
SELECT "works".* FROM "works" WHERE "works"."franchise_id" = 3 AND "works"."pos_x" IS NOT NULL
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 3 LIMIT 1

  def update_coordinates
    work = Work.find(params[:id])
    work.update(pos_x: params[:pos_x], pos_y: params[:pos_y])
---
SELECT "works".* FROM "works" WHERE "works"."id" = 6 LIMIT 1
UPDATE "works" SET "updated_at" = '2026-04-15 12:35:20.042333', "pos_x" = 1063, "pos_y" = -89 WHERE "works"."id" = 25

  def create_node
    current_franchise = Franchise.find(params[:franchise_id])
    tv_type = MediaType.find_by(name: 'TV Series') || MediaType.first
    new_title = params[:title].present? ? params[:title] : "Новый сезон"

    new_work = Work.create!(
      title: new_title,
      franchise: current_franchise,
      media_type: tv_type,
      parent_id: params[:parent_id],
      pos_x: params[:pos_x],
      pos_y: params[:pos_y],
      image_url: params[:image_url]
    )
---
SELECT "media_types".* FROM "media_types" WHERE "media_types"."name" = 'TV Series' LIMIT 1
INSERT INTO "works" ("created_at", "franchise_id", "media_type_id", "plot_summary", "poster_url", "release_year", "synopsis", "title", "updated_at", "pos_x", "pos_y", "parent_id", "image_url") VALUES ('2026-04-06 10:31:43.071185', 4, 3, NULL, NULL, NULL, NULL, 'fate for gays', '2026-04-06 10:31:43.071185', 1652, 478, NULL, '') RETURNING "id"

  def update_node
    work = Work.find(params[:id])
    p_id = params[:parent_id].present? ? params[:parent_id] : nil
    work.update(title: params[:title], parent_id: p_id, image_url: params[:image_url])
---
SELECT "works".* FROM "works" WHERE "works"."id" = 28 LIMIT 1
UPDATE "works" SET "updated_at" = '2026-03-31 16:39:29.406034', "parent_id" = NULL WHERE "works"."id" = 28

  def delete_node
    work = Work.find(params[:id])
    Work.where(parent_id: work.id).update_all(parent_id: nil)
    work.destroy
---
SELECT "works".* FROM "works" WHERE "works"."id" = 6 LIMIT 1
UPDATE "works" SET "updated_at" = '2026-04-01 08:21:03.152236', "parent_id" = NULL WHERE "works"."id" = 31
DELETE FROM "works" WHERE "works"."id" = 28