app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "franchise_id", "content", "rating", "created_at", "updated_at") VALUES (1, 1, 'ШЕДЕВР!!!!', 5, '2026-02-26 13:04:22.111145', '2026-02-26 13:04:22.111145') RETURNING "id"
---
  def create
    @review = current_user.reviews.build(review_params)
    if @review.save