app/controllers/sessions_controller.rb

  def create
    # Ищем пользователя по email
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@test.com' LIMIT 1