app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    # Автоматически находим в БД роль "User" и присваиваем её новичку
    user_role = UserRole.find_by(role_name: 'User')
    @user.user_role = user_role

    if @user.save
---
SELECT "user_roles".* FROM "user_roles" WHERE "user_roles"."role_name" = 'User' LIMIT 1
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "user_role_id", "username") VALUES ('2026-02-26 15:06:49.102514', 'naistow@mail.ru', '$2a$12$m2CbZznd./HmT3wTLEW1sOO67.bJ8nwlpTPr30wSmI.oqxVA0DtRW', '2026-02-26 15:06:49.102514', 2, 'naistow') RETURNING "id"