app/controllers/user_progresses_controller.rb

  def update_or_create
    @progress = current_user.user_progresses.find_or_initialize_by(work_id: params[:work_id])

    if params[:status].blank?
      @progress.destroy if @progress.persisted?
      message = "Статус сброшен"
    else
      @progress.status = params[:status]
      @progress.save
---
SELECT "user_progresses".* FROM "user_progresses" WHERE "user_progresses"."user_id" = 1 AND "user_progresses"."work_id" = 1 LIMIT 1
DELETE FROM "user_progresses" WHERE "user_progresses"."id" = 1
UPDATE "user_progresses" SET "status" = 'watching', "updated_at" = '2026-02-26 13:20:37.646159' WHERE "user_progresses"."id" = 1