app/controllers/works_controller.rb

  def show
    @work = Work.find(params[:id])
    @episodes = @work.respond_to?(:episodes) ? @work.episodes.order(:id) : []
---
SELECT "works".* FROM "works" WHERE "works"."id" = 6 LIMIT 1
SELECT "episodes".* FROM "episodes" WHERE "episodes"."work_id" = 6 ORDER BY "episodes"."id" ASC

  def update
    @work = Work.find(params[:id])

    # Защита: разрешаем обновление только админам
    if defined?(current_user) && current_user.try(:admin?)
      if @work.update(work_params)
---
SELECT "works".* FROM "works" WHERE "works"."id" = 6 LIMIT 1
UPDATE "works" SET "updated_at" = '2026-04-06 11:26:46.018555', "description" = 'Сюжет' WHERE "works"."id" = 6